app/views/users/index.html.erb

	<td><%= link_to 'Patients:' , drp_path(user) %></td>
	<td><%= user.patients.count %></td>
---
SELECT COUNT(*) FROM `patients` WHERE `patients`.`user_id` = 1