app/views/patients/drp.html.erb


<% @dr.patients.each do |p| %>
---
SELECT `patients`.* FROM `patients` WHERE (1)