app/views/doctors/index.html.erb

	<td><%= link_to 'Patients:' , drp_path(doctor) %></td>
	<td><%= doctor.patients.count %></td>
---
SELECT COUNT(*) FROM `patients` WHERE `patients`.`doctor_id` = 1