app/controllers/doctors_controller.rb

  def index
 #   if user_signed_in?
	   if current_user.email == "charly613@gmail.com"
			@doctors = Doctor.all
---
SELECT `doctors`.* FROM `doctors`

  def show
    @doctor = Doctor.find(params[:id])

	@drpcount = @doctor.patients.count
---
SELECT `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `patients` WHERE `patients`.`doctor_id` = 1

  def edit
    @doctor = Doctor.find(params[:id])
---
SELECT `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 1 LIMIT 1

  def create
    @doctor = Doctor.new(params[:doctor])

    respond_to do |format|
      if @doctor.save
---
INSERT INTO `doctors` (`created_at`, `docmobile`, `email`, `name`, `phone`, `updated_at`) VALUES ('2012-01-19 16:01:16', NULL, 'bt@abc.com', 'bernardo', '12345678', '2012-01-19 16:01:16')

  def update
    @doctor = Doctor.find(params[:id])

    respond_to do |format|
      if @doctor.update_attributes(params[:doctor])
---
SELECT `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 2 LIMIT 1
UPDATE `doctors` SET `name` = 'MOnica', `email` = 'mtanur@123.com', `updated_at` = '2012-02-02 05:46:54' WHERE `doctors`.`id` = 2