app/controllers/patients_controller.rb

  def index
    if (params[:id] == nil and current_user.email == "charly613@gmail.com")
		@patients = Patient.all
	else
		@dr = Doctor.find(current_user.id)
---
SELECT `patients`.* FROM `patients`
SELECT `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 1 LIMIT 1

  def show
    @patient = Patient.find(params[:id])
---
SELECT `patients`.* FROM `patients` WHERE `patients`.`id` = 0 LIMIT 1

  def new
	@d = Doctor.find(current_user.id)
	@patient = @d.patients.build
	@patient.save
---
SELECT `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 2 LIMIT 1
INSERT INTO `patients` (`address`, `created_at`, `doctor_id`, `fechanac`, `history`, `mail`, `name`, `phone`, `updated_at`, `user_id`) VALUES (NULL, '2012-02-10 05:32:37', NULL, NULL, NULL, NULL, NULL, NULL, '2012-02-10 05:32:37', 2)

  def edit
    @patient = Patient.find(params[:id])
---
SELECT `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1

  def drp
	if ( current_user.id == Integer(params[:id]) or current_user.email == "charly613@gmail.com" )
		@dr = Doctor.find(params[:id])
---
SELECT `doctors`.* FROM `doctors` WHERE `doctors`.`doctor_id` IS NULL

  def create
	@doctor = Patient.find(params[:id])
	@patient = @doctor.patients.build(params[:patient])

    #@patient = Patient.new(params[:patient])

    respond_to do |format|
      if @patient.save
---
INSERT INTO `patients` (`address`, `created_at`, `doctor_ID`, `fechanac`, `history`, `mail`, `name`, `phone`, `updated_at`) VALUES ('', '2012-01-19 16:13:51', NULL, '2011-10-19', 'saludable', 'mtanur@g.com', 'monica', '45678912', '2012-01-19 16:13:51')

  def update
    @patient = Patient.find(params[:id])

    respond_to do |format|
      if @patient.update_attributes(params[:patient])
---
SELECT `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1
UPDATE `patients` SET `doctor_id` = 1, `name` = 'batia', `history` = 'bien bh', `mail` = '123@wer.com', `phone` = '1234', `address` = 'h 123', `fechanac` = '2012-02-02', `updated_at` = '2012-02-02 19:44:41' WHERE `patients`.`id` = 6

  def destroy
    @patient = Patient.find(params[:id])
    @patient.destroy
---
SELECT `patients`.* FROM `patients` WHERE `patients`.`id` = 5 LIMIT 1
DELETE FROM `patients` WHERE `patients`.`id` = 5