app/controllers/patients_controller.rb

  def index
    if (params[:id] == nil and current_user.email == "charly613@gmail.com")
		#@patients = Patient.all
		redirect_to users_url
	else
		@usr = User.find(current_user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def new
	@u = User.find(current_user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def drp
	if ( current_user.id == Integer(params[:id]) or current_user.email == "charly613@gmail.com" )
		@usr = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1