app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
 #   if user_signed_in?
	   if current_user.email == "charly613@gmail.com"
			@users = User.all